In [1]:
from sqlalchemy import create_engine

In [2]:
Engine = create_engine(f'postgresql://postgres:postgres@localhost:5432/postgres')

In [194]:
import pandas
def read_sql_to_df(query):
    return pandas.read_sql_query(query, con=Engine)
class ChannelTable:
    def __init__(self, stream, time=None):
        self.stream = stream
    
    @property
    def table_name(self):
        return 

    def streams_count(self):
        return read_sql_to_df(f'select DISTINCT started_at from {self.table_name};')


class StreamTable(ChannelTable):
    def __init__(self, stream, time=None):
        self.time = time
        super(StreamTable, self).__init__(stream)
    
    @property
    def condition(self):  
        return f"WHERE started_at = '{self.time}'" if self.time else ''

    @property
    def table_name(self):
        return self.stream

    def top_users_sql(self):
        query = f'SELECT username, COUNT(*) AS "count" from {self.table_name} {self.condition} group by username ORDER BY COUNT DESC;'
        print(query)
        return read_sql_to_df(query)
    
    def get_data_frame(self):
        query = f"SELECT * FROM {self.table_name} {self.condition}"
        return read_sql_to_df(query)
    
    def top_words(self, sort=False):
        sort = 'ORDER BY nentry DESC' if sort else ''
        query = f'SELECT word, nentry as "count" FROM ts_stat($$ \
                                SELECT to_tsvector({self.table_name}.msg) \
                                FROM {self.table_name} {self.condition}\
                                $$) {sort};'
        return read_sql_to_df(query)

In [143]:
i = StreamSniper("sodapoppin")

In [144]:
i.streams_count()

             started_at
0  2020-03-04T19:52:16Z
1  2020-03-10T00:32:13Z
2  2020-03-07T19:50:57Z
3  2020-03-05T19:49:33Z
4  2020-03-03T19:03:14Z

In [145]:
i.top_users_sql()

select username, COUNT(*) AS "count" from sodapoppin  group by username ORDER BY COUNT DESC;

            username  count
0          guactoast   3205
1          kirisaite   3175
2             anaxai   3141
3               kalg   2461
4          bhshelley   1884
...              ...    ...
39897    manifresh38      1
39898      auron2ooo      1
39899  stacelsgaming      1
39900      vanhelsey      1
39901    keztherogue      1

[39902 rows x 2 columns]

In [146]:
i.get_data_frame()

,id,username,msg,started_at,timestamp
0,1,rosestride2,@vulpeshd hey widepeepoHappy,2020-03-03T19:03:14Z,2020-03-03 19:04:46.715782
1,2,legoman0290,the title PepeLaugh,2020-03-03T19:03:14Z,2020-03-03 19:04:46.933259
2,3,wraykappa,pepeD,2020-03-03T19:03:14Z,2020-03-03 19:04:51.617403
3,4,imtwista,FINALLYYYY PogChamp,2020-03-03T19:03:14Z,2020-03-03 19:04:53.337675
4,5,vulpeshd,@rosestride2 hi ðŸ™‚,2020-03-03T19:03:14Z,2020-03-03 19:04:53.774508
...,...,...,...,...,...
453931,453922,sur3legend007,<3,2020-03-10T00:32:13Z,2020-03-10 23:42:20.845916
453932,453923,igor_rezn1koff,peepoLeave,2020-03-10T00:32:13Z,2020-03-10 23:42:21.058853
453933,453924,zulmogarga,not even 24 hours LULW,2020-03-10T00:32:13Z,2020-03-10 23:42:21.944531
453934,453935,deraffenfan,@Jazzykat but i dont want to peepoLeave,2020-03-10T00:32:13Z,2020-03-10 23:42:30.212473
453935,453936,the1_logan,peepoLeave later chat,2020-03-10T00:32:13Z,2020-03-10 23:42:30.292837

In [147]:

i.get_word_usage(i.top_words(), 'lulw')

24388    33053
Name: count, dtype: int64

In [148]:
i.time = "2020-03-04T19:52:16Z"

In [149]:
i.get_word_usage(i.top_words(), 'lulw')

5860    3266
Name: count, dtype: int64

In [161]:
from collections import defaultdict
import re 
class PandasHandler:
    def __init__(self, data_frame):
        self.data_frame = data_frame

    def top_by_coulumn(self, column, top):
        return self.data_frame[column].value_counts().rename_axis(column).reset_index(name='count')[:top]
    
    def top_words_usage(self, column, top):
        result = defaultdict(int)
        for i in self.data_frame[column].to_dict().values():
            for word in re.findall(r"[a-zA-Z\-0-9\.:,_'\"]+", i):
                    result[word] += 1
        return pandas.DataFrame.from_dict(result, orient='index').sort_values(0, ascending=False)[:top].reset_index().rename(columns={0: 'count', 'index':"word"})
    
    def get_word_usage(self, word, column):
        return len(self.data_frame[column].str.lower().str.findall(r"[\b|^]*({})\b".format(word), flags = re.I).sum())

    def get_words_examples(self, word, column, char_limit=10):
        mask = (self.data_frame[column].str.len() >= char_limit )
        return self.data_frame[self.data_frame[column].str.contains(r"[\b|^]*({})\b".format(word), flags = re.I)].loc[mask]

In [162]:
ph = PandasHandler(i.get_data_frame())

In [163]:
ph.top_by_coulumn('username', 10)

       username  count
0          kalg   1112
1     kirisaite    615
2     guactoast    572
3        ludias    330
4      lidlfrog    302
5  forsenkkona_    282
6          zuby    279
7        anaxai    264
8     bhshelley    244
9   copsycallum    232

In [164]:
i.top_users_sql()[:10]

select username, COUNT(*) AS "count" from sodapoppin WHERE started_at = '2020-03-04T19:52:16Z' group by username ORDER BY COUNT DESC;

       username  count
0          kalg   1112
1     kirisaite    615
2     guactoast    572
3        ludias    330
4      lidlfrog    302
5  forsenkkona_    282
6          zuby    279
7        anaxai    264
8     bhshelley    244
9   copsycallum    232

In [172]:
word_isage = ph.top_words_usage('msg', 10)

In [166]:
ph.get_word_usage('yep cock', 'msg')

13

In [167]:
ph.get_words_examples('YEP COCK', 'msg')

/home/andrei/.local/lib/python3.6/site-packages/pandas/core/strings.py:1952: UserWarning: This pattern has match groups. To actually get the groups, use str.extract.
  return func(self, *args, **kwargs)

,id,username,msg,started_at,timestamp
430,76657,copthatl,Yep COCK squadR Yep COCK squadR Yep COCK squad...,2020-03-04T19:52:16Z,2020-03-04 20:01:51.458789
641,76868,copthatl,Yep COCK squadR Yep COCK squadR Yep COCK squadR,2020-03-04T19:52:16Z,2020-03-04 20:03:01.116974

In [175]:
class ChannelTable:
    def __init__(self, stream, time=None):
        self.stream = stream
    
    @property
    def table_name(self):
        return 

    def streams_count(self):
        return read_sql_to_df(f'select DISTINCT started_at from {self.table_name};')

In [186]:
class TopTable(ChannelTable):
    top_kind = {
            'w': 'word_usage',
            'u': 'user_usage'
        }
    def __init__(self, stream, top_kind, top_df=None):
        self.top_df = top_df
        self.tkind = top_kind
        super(TopTable, self).__init__(stream)

    @property
    def table_name(self):
        return self.stream + self.top_kind[self.tkind]

    def write_df_to_sql(self, additional_value=None):
        if additional_value:
            (k,v), = additional_value.items()
            self.top_df[k] = v #datetime.strptime(v, '%Y-%m-%dT%XZ').date().isoformat()
        self.top_df.to_sql(self.table_name, Engine,  if_exists="append")

In [189]:
tt = TopTable('sodapoppin', 'w', word_isage)

In [190]:
tt.table_name

'sodapoppinword_usage'

In [184]:
tt.write_df_to_sql({'started_at':'2020-03-07T19:50:57Z'})

In [191]:
tt.streams_count()

             started_at
0  2020-03-07T19:50:57Z

In [196]:
st = StreamTable('sodapoppin')
tt =  TopTable('sodapoppin', 'w')

In [207]:
set(st.streams_count()['started_at'].to_list()) - set(tt.streams_count()['started_at'].to_list())

{'2020-03-03T19:03:14Z',
 '2020-03-04T19:52:16Z',
 '2020-03-05T19:49:33Z',
 '2020-03-10T00:32:13Z'}

In [213]:

st.streams_count().merge(tt.streams_count(), on='started_at', how='left')

             started_at
0  2020-03-04T19:52:16Z
1  2020-03-10T00:32:13Z
2  2020-03-07T19:50:57Z
3  2020-03-05T19:49:33Z
4  2020-03-03T19:03:14Z